{
  "hadiths": [
    {
      "hadithnumber": 1,
      "arabicnumber": 1,
      "text": "It was narrated from the Commander of the Faithful, Abu Hafs Umar ibn al-Khattab, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace be upon him, say: \"Deeds are only by intentions, and a man will only have that which he intended. So whoever's migration was for Allah and His Messenger, then his migration is for Allah and His Messenger. And whoever's migration was for worldly gain or a woman to marry, then his migration is for that which he migrated for.\"\nNarrated by the two Imams of the Muhaddithin, Abu Abdullah Muhammad ibn Ismail ibn Ibrahim ibn al-Mughirah ibn Bardizbah al-Bukhari al-Ju'fi [No: 1], and Abu al-Husayn Muslim ibn al-Hajjaj ibn Muslim al-Qushayri al-Naysaburi [No: 1907], may Allah be pleased with them both, in their \"Sahihayn,\" which are the most authentic books compiled. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 1
      },
      "narration": null
    },
    {
      "hadithnumber": 2,
      "arabicnumber": 2,
      "text": "Narrated by Umar (may Allah be pleased with him): \"While we were sitting with the Messenger of Allah (peace and blessings be upon him) one day, a man appeared before us, extremely white in his clothes, extremely black in his hair, showing no signs of travel, and none of us recognized him. He sat down next to the Prophet (peace and blessings be upon him), rested his knees against his knees, and placed his hands on his thighs.\n\nHe said: 'O Muhammad, tell me about Islam.'\n\nThe Messenger of Allah (peace and blessings be upon him) replied: 'Islam is to testify that there is no god but Allah and that Muhammad is the Messenger of Allah, to establish prayer, to pay zakat, to fast Ramadan, and to perform Hajj to the House if you are able to do so.'\n\nHe said: 'You have spoken the truth.' We were amazed that he asked him and then confirmed his words.\n\nHe said: 'Then tell me about Iman (faith).'\n\nHe replied: 'To believe in Allah, His angels, His books, His messengers, the Last Day, and to believe in the divine decree, both its good and its evil.'\n\nHe said: 'You have spoken the truth.' He said: 'Then tell me about Ihsan (excellence).'\n\nHe replied: 'To worship Allah as if you see Him, and if you do not see Him, then know that He sees you.'\n\nHe said: 'Then tell me about the Hour.' He replied: 'The one being asked about it knows no more than the one asking.'\n\nHe said: 'Then tell me about its signs.' He replied: 'That the slave woman gives birth to her mistress, and that you see the barefoot, naked, destitute shepherds competing in building tall buildings.' Then he left. I remained for a while.\n\nThen he said: 'O Umar, do you know who the questioner was?'\n\nI said: 'Allah and His Messenger know best.'\n\nHe said: 'That was Jibril (Gabriel) who came to you to teach you your religion.'\" [Narrated by Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 2
      },
      "narration": null
    },
    {
      "hadithnumber": 3,
      "arabicnumber": 3,
      "text": "It was narrated from Abu 'Abdur-Rahman 'Abdullah bin 'Umar bin Al-Khattab, may Allah be pleased with them both, that he said: I heard the Messenger of Allah (peace and blessings be upon him) say: \"Islam is built on five pillars: testifying that there is no god but Allah and that Muhammad is His Messenger, establishing the prayer, giving Zakat, performing Hajj to the House, and fasting Ramadan.\" [Narrated by Al-Bukhari], [and Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 3
      },
      "narration": null
    },
    {
      "hadithnumber": 4,
      "arabicnumber": 4,
      "text": "It was narrated from Abu Abd al-Rahman Abdullah ibn Mas'ud, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, told us - and he was the truthful, the believed: \"Verily, each of you is created in the womb of his mother for forty days as a sperm, then he becomes a clinging mass for a similar period, then he becomes a lump of flesh for a similar period. Then an angel is sent to him and he breathes the spirit into him, and he is commanded to write four words: to write his provision, his lifespan, his deeds, and whether he is wretched or blessed. By Allah, besides Whom there is no other god, one of you may do the deeds of the people of Paradise until there is nothing between him and it but a cubit, but the decree overtakes him and he does the deeds of the people of the Fire and enters it. And one of you may do the deeds of the people of the Fire until there is nothing between him and it but a cubit, but the decree overtakes him and he does the deeds of the people of Paradise and enters it.\" [Narrated by Bukhari] [and Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 4
      },
      "narration": null
    },
    {
      "hadithnumber": 5,
      "arabicnumber": 5,
      "text": "From the Mother of the Believers, Umm Abd Allah, Aisha, may Allah be pleased with her, she said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever introduces into this matter of ours something that is not of it, then it is rejected.\" [Bukhari narrated it], [and Muslim]. And in a narration of Muslim: \"Whoever performs an action not in accordance with our command, then it is rejected.\" [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 5
      },
      "narration": null
    },
    {
      "hadithnumber": 6,
      "arabicnumber": 6,
      "text": "It was narrated from Abu Abdullah Al-Nu'man bin Bashir (may Allah be pleased with them both) that he said: I heard the Messenger of Allah (peace and blessings be upon him) say: \"Indeed, what is lawful is clear and what is unlawful is clear, and between them are matters which are doubtful, which many people do not know. So whoever is cautious of the doubtful has absolved himself in regard to his religion and his honor. And whoever falls into doubtful matters will fall into what is unlawful, just as a shepherd who pastures his sheep around a protected area is likely to enter it. Verily, every king has a protected area, and verily, the protected area of Allah is His prohibitions. Verily, in the body there is a morsel of flesh which, if it is sound, the whole body is sound, and if it is corrupt, the whole body is corrupt. Verily, it is the heart.\" [Narrated by Al-Bukhari] and [Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 6
      },
      "narration": null
    },
    {
      "hadithnumber": 7,
      "arabicnumber": 7,
      "text": "On the authority of Abu Ruqayyah Tamim bin Aws Al-Dari (may Allah be pleased with him) that the Prophet (peace and blessings of Allah be upon him) said: \"Religion is advice.\" We said: \"To whom?\" He said: \"To Allah, and to His Book, and to His Messenger, and to the leaders of the Muslims and their common people.\" [Narrated by Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 7
      },
      "narration": null
    },
    {
      "hadithnumber": 8,
      "arabicnumber": 8,
      "text": "Narrated Ibn Umar (may Allah be pleased with them both) that the Messenger of Allah (peace be upon him) said: \"I have been commanded to fight people until they testify that there is no god but Allah and that Muhammad is the Messenger of Allah, and they establish prayer and pay Zakat. If they do that, their blood and wealth are protected from me, except by the right of Islam, and their reckoning is with Allah the Almighty.\" [Reported by Bukhari and Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 8
      },
      "narration": null
    },
    {
      "hadithnumber": 9,
      "arabicnumber": 9,
      "text": "It was narrated from Abu Hurayrah Abdur-Rahman ibn Sakhr, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace and blessings be upon him, say: \"Whatever I have forbidden you, avoid it. And whatever I have commanded you to do, do of it as much as you can. For indeed, those who came before you were destroyed by their excessive questioning and their disputes with their prophets.\" [Narrated by Bukhari] and [Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 9
      },
      "narration": null
    },
    {
      "hadithnumber": 10,
      "arabicnumber": 10,
      "text": "It was narrated from Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace and blessings be upon him) said: \"Indeed, Allah is Good and does not accept anything but that which is good. And indeed, Allah has commanded the believers to do what He commanded the Messengers. He said: 'O Messengers, eat of the good things and do righteous deeds.' And He said: 'O you who have believed, eat of the good things which We have provided for you.' Then he mentioned a man who travels long distances, disheveled and covered in dust, raising his hands to the sky, saying: 'O Lord! O Lord!' but his food is unlawful, his drink is unlawful, his clothing is unlawful, and he has been nourished with unlawful things. How can he be answered?\" [Narrated by Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 10
      },
      "narration": null
    },
    {
      "hadithnumber": 11,
      "arabicnumber": 11,
      "text": "From Abu Muhammad al-Hasan ibn Ali ibn Abi Talib, the grandson of the Messenger of Allah (peace and blessings be upon him) and his beloved, may Allah be pleased with them both, he said: I memorized from the Messenger of Allah (peace and blessings be upon him): \"Leave that which makes you doubt for that which does not make you doubt.\"\nNarrated by Tirmidhi [2520], and Nasa'i. Tirmidhi said: This is a hasan sahih hadith. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 11
      },
      "narration": null
    },
    {
      "hadithnumber": 12,
      "arabicnumber": 12,
      "text": "It was narrated from Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"Among the good qualities of a person's Islam is his leaving alone that which does not concern him.\" This is a Hasan Hadith, narrated by Tirmidhi [2318] and Ibn Majah [3976]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 12
      },
      "narration": null
    },
    {
      "hadithnumber": 13,
      "arabicnumber": 13,
      "text": "On the authority of Abu Hamzah Anas bin Malik (may Allah be pleased with him), the servant of the Messenger of Allah (peace and blessings be upon him), that the Prophet (peace and blessings be upon him) said: \"None of you truly believes until he loves for his brother what he loves for himself.\"\nNarrated by Bukhari [No. 13] and Muslim [No. 45]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 13
      },
      "narration": null
    },
    {
      "hadithnumber": 14,
      "arabicnumber": 14,
      "text": "It was narrated from Ibn Mas'ud (may Allah be pleased with him) that the Messenger of Allah (peace and blessings be upon him) said: \"The blood of a Muslim is not lawful [bearing witness that there is no god but Allah, and that I am the Messenger of Allah] except in three cases: the married adulterer, a life for a life, and the one who abandons his religion and separates from the community.\" [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 14
      },
      "narration": null
    },
    {
      "hadithnumber": 15,
      "arabicnumber": 15,
      "text": "On the authority of Abu Hurayrah, may God be pleased with him, that the Messenger of God, peace and blessings be upon him, said: \"Whoever believes in God and the Last Day, let him speak good or remain silent; whoever believes in God and the Last Day, let him honor his neighbor; and whoever believes in God and the Last Day, let him honor his guest.\" [Narrated by Al-Bukhari] and [Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 15
      },
      "narration": null
    },
    {
      "hadithnumber": 16,
      "arabicnumber": 16,
      "text": "On the authority of Abu Hurayrah, may Allah be pleased with him, that a man said to the Prophet, peace be upon him: \"Advise me.\" He said: \"Do not get angry.\" He repeated it several times. He said: \"Do not get angry.\" [Narrated by Al-Bukhari] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 16
      },
      "narration": null
    },
    {
      "hadithnumber": 17,
      "arabicnumber": 17,
      "text": "Narrated by Abu Ya'la Shaddad bin Aws (may Allah be pleased with him) that the Messenger of Allah (peace and blessings be upon him) said: \"Allah has enjoined ihsan (benevolence) in all things. So when you kill, kill well, and when you slaughter, slaughter well. Let one of you sharpen his blade and let him spare his animal.\" [Reported by Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 17
      },
      "narration": null
    },
    {
      "hadithnumber": 18,
      "arabicnumber": 18,
      "text": "On the authority of Abu Dharr Jundub ibn Junadah and Abu Abd al-Rahman Mu'adh ibn Jabal, may Allah be pleased with them both, that the Messenger of Allah (peace and blessings be upon him) said: \"Fear Allah wherever you are, and follow a bad deed with a good deed that will erase it, and treat people with good character.\"\n\nReported by Tirmidhi [No. 1987] and said: A hadith hasan, and in some versions: hasan sahih. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 18
      },
      "narration": null
    },
    {
      "hadithnumber": 19,
      "arabicnumber": 19,
      "text": "On the authority of Abdullah bin Abbas (may Allah be pleased with them both) who said: \"I was behind the Messenger of Allah (peace be upon him) one day when he said: 'O young man! I will teach you some words: Guard Allah, and He will guard you. Guard Allah, and you will find Him before you. If you ask, ask Allah. If you seek help, seek help from Allah. And know that if the [entire] creation were to gather to benefit you with something, they would not benefit you except with something that Allah has already decreed for you. And if they were to gather to harm you with something, they would not harm you except with something that Allah has already decreed against you. The pens have been lifted, and the pages have dried.'\" Narrated by Tirmidhi [no. 2516] and said: It is a hasan sahih hadith. In another narration by someone other than Tirmidhi: \"Guard Allah and you will find Him in front of you. Recognize Allah in times of ease, and He will recognize you in times of hardship. And know that what you have missed was not meant to reach you, and what has reached you was not meant to miss you. And know that victory comes with patience, and relief comes with distress, and with hardship comes ease.\" [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 19
      },
      "narration": null
    },
    {
      "hadithnumber": 20,
      "arabicnumber": 20,
      "text": "Abu Mas'ud 'Uqbah ibn 'Amr al-Ansari al-Badri (may Allah be pleased with him) reported: The Messenger of Allah (peace and blessings be upon him) said: \"Among the sayings of the earlier prophethood that people have come to know is: If you have no shame, then do whatever you wish.\" [Bukhari] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 20
      },
      "narration": null
    },
    {
      "hadithnumber": 21,
      "arabicnumber": 21,
      "text": "It was narrated from Abu Amr, and it was also said Abu 'Amrah Sufyan bin 'Abdullah, may Allah be pleased with him, who said: \"I said: 'O Messenger of Allah! Tell me something about Islam, after which I will not ask anyone else.' He said: 'Say: I believe in Allah, then be steadfast.'\" [Narrated by Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 21
      },
      "narration": null
    },
    {
      "hadithnumber": 22,
      "arabicnumber": 22,
      "text": "From Abu Abdullah Jabir bin Abdullah Al-Ansari, may Allah be pleased with them both: \"A man asked the Messenger of Allah, peace and blessings be upon him, and said: 'Do you think if I observe the obligatory prayers, fast Ramadan, consider what is lawful as lawful, and what is unlawful as unlawful, and do not do more than that, I will enter Paradise?' He said: 'Yes.'\" [Narrated by Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 22
      },
      "narration": null
    },
    {
      "hadithnumber": 23,
      "arabicnumber": 23,
      "text": "It was narrated from Abu Malik Al-Harith bin Al-Harith Al-Ash'ari, may Allah be pleased with him, that the Messenger of Allah (peace and blessings be upon him) said: \"Purity is half of faith. Praise be to Allah fills the scales. Glory be to Allah and praise be to Allah fill - or: fills - what is between the heavens and the earth. Prayer is a light, charity is proof, patience is illumination, and the Qur'an is an argument for you or against you. All people wake up in the morning selling themselves, thereby freeing them or destroying them.\" [Narrated by Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 23
      },
      "narration": null
    },
    {
      "hadithnumber": 24,
      "arabicnumber": 24,
      "text": "On the authority of Abu Dharr al-Ghifari, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, as he narrates from his Lord, Blessed and Exalted is He, that He said: \"O My servants: I have forbidden injustice upon Myself, and made it forbidden among you; so do not be unjust to one another. O My servants! All of you are astray except those whom I guide, so seek guidance from Me, and I will guide you. O My servants! All of you are hungry except those whom I feed, so seek food from Me, and I will feed you. O My servants! All of you are naked except those whom I clothe, so seek clothing from Me, and I will clothe you. O My servants! You sin by night and day, and I forgive all sins; so seek forgiveness from Me, and I will forgive you. O My servants! You will never be able to harm Me so as to harm Me, nor will you be able to benefit Me so as to benefit Me. O My servants! If the first of you and the last of you, and your humans and jinn, were all to be as pious as the most pious heart of one man amongst you, that would not increase My kingdom in anything. O My servants! If the first of you and the last of you, and your humans and jinn, were all to be as wicked as the most wicked heart of one man amongst you, that would not decrease My kingdom in anything. O My servants! If the first of you and the last of you, and your humans and jinn, were to stand on a single plain and ask Me, and I were to give every one of them what they asked for, that would not diminish what I possess except as much as a needle diminishes the sea when it is dipped into it. O My servants! These are only your deeds that I count for you, and then I will repay you for them. So whoever finds good, let him praise Allah, and whoever finds other than that, let him blame only himself.\" [Narrated by Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 24
      },
      "narration": null
    },
    {
      "hadithnumber": 25,
      "arabicnumber": 25,
      "text": "From Abu Dharr, may Allah be pleased with him, it is also reported that some of the companions of the Messenger of Allah, peace be upon him, said to the Prophet, peace be upon him: \"O Messenger of Allah, the wealthy have gone away with the rewards. They pray as we pray, and they fast as we fast, and they give charity from the surplus of their wealth.\" He said: \"Has not Allah made for you that which you can give in charity? Indeed, every Tasbeeh (saying 'Subhan Allah') is a charity, every Takbeer (saying 'Allahu Akbar') is a charity, every Tahmeed (saying 'Alhamdulillah') is a charity, every Tahleel (saying 'La ilaha illa Allah') is a charity, enjoining good is a charity, forbidding evil is a charity, and in your sexual intercourse there is charity.\" They said: \"O Messenger of Allah, when one of us fulfills his desire, will he have a reward for it?\" He said: \"Do you not think that if he were to place it in a forbidden way, he would bear a sin? Likewise, when he places it in a halal way, he has a reward.\" [Narrated by Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 25
      },
      "narration": null
    },
    {
      "hadithnumber": 26,
      "arabicnumber": 26,
      "text": "It was narrated from Abu Hurayrah, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"For every joint of the people, there is a charity every day that the sun rises. To be just between two is a charity. To help a man on his mount, or to lift his belongings onto it, is a charity. And the good word is a charity. And every step you take towards prayer is a charity. And removing harmful things from the road is a charity.\" [Narrated by Bukhari] [and Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 26
      },
      "narration": null
    },
    {
      "hadithnumber": 27,
      "arabicnumber": 27,
      "text": "On the authority of Al-Nawwas bin Sam'an (may Allah be pleased with him) from the Prophet (peace and blessings of Allah be upon him) who said: \"Righteousness is good character, and sin is what makes you uneasy in your heart and what you dislike people to know about.\" Narrated by Muslim. And on the authority of Wabisah bin Ma'bad (may Allah be pleased with him) who said: I came to the Messenger of Allah (peace and blessings of Allah be upon him) and he said: \"You have come to ask about righteousness?\" I said: \"Yes.\" He said: \"Ask your heart. Righteousness is what your soul and heart are at ease with, and sin is what makes your soul uneasy and what wavers in your chest, even if people issue rulings to you and issue rulings.\" A hasan hadith, which we have narrated in the Musnads of the two Imams, Ahmad bin Hanbal and Al-Darimi, with a hasan chain of narration. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 27
      },
      "narration": null
    },
    {
      "hadithnumber": 28,
      "arabicnumber": 28,
      "text": "On the authority of Abu Najih al-Irbad ibn Sariyah (may Allah be pleased with him), who said: \"The Messenger of Allah (peace and blessings of Allah be upon him) gave us a sermon from which hearts trembled and eyes shed tears. We said, 'O Messenger of Allah! It is as if it is a farewell sermon, so advise us.' He said: 'I advise you to fear Allah, and to listen and obey, even if a slave is appointed over you. For whoever lives among you will see much disagreement. So adhere to my Sunnah and the Sunnah of the Rightly Guided Caliphs. Bite onto it with your molars, and beware of newly invented matters, for every innovation is misguidance.'\" [Reported by Abu Dawud], and Al-Tirmidhi [No. 266] and said it is a Hasan Sahih hadith. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 28
      },
      "narration": null
    },
    {
      "hadithnumber": 29,
      "arabicnumber": 29,
      "text": "On the authority of Mu'adh ibn Jabal (may Allah be pleased with him) who said: I said, \"O Messenger of Allah! Tell me of a deed that will admit me to Paradise and distance me from the Fire.\" He said: \"You have asked about something great, and it is easy for him for whom Allah makes it easy. You worship Allah, associating nothing with Him, establish prayer, give zakah, fast Ramadan, and perform pilgrimage to the House.\" Then he said: \"Shall I not guide you to the gates of goodness? Fasting is a shield, charity extinguishes sins as water extinguishes fire, and a person's prayer in the depth of the night.\" Then he recited: \"Their sides forsake their beds...\" until he reached \"...they do\" [Surah As-Sajdah, verses 16-17]. Then he said: \"Shall I not inform you of the head of the matter, its pillar, and its highest point?\" I said: \"Yes, O Messenger of Allah.\" He said: \"The head of the matter is Islam, its pillar is prayer, and its highest point is Jihad.\" Then he said: \"Shall I not inform you of the key to all of that?\" I said: \"Yes, O Messenger of Allah!\" He took hold of his tongue and said: \"Restrain this.\" I said: \"O Prophet of Allah! Will we be held accountable for what we say?\" He said: \"May your mother be bereaved of you! What else throws people onto their faces – or he said, onto their noses – but the harvest of their tongues?\"\n\nNarrated by Tirmidhi [No. 2616] and he said: It is a Hasan Sahih hadith. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 29
      },
      "narration": null
    },
    {
      "hadithnumber": 30,
      "arabicnumber": 30,
      "text": "On the authority of Abu Tha'labah al-Khushani, Jurthum bin Nashir, may Allah be pleased with him, from the Messenger of Allah, peace be upon him, who said: \"Indeed, Allah the Almighty has ordained obligations, so do not neglect them. He has set boundaries, so do not transgress them. He has forbidden things, so do not violate them. And He has remained silent about things out of mercy for you, not forgetfulness, so do not inquire about them.\"\n\nA hasan hadith, narrated by Al-Daraqutni in his Sunan [4/184], and others. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 30
      },
      "narration": null
    },
    {
      "hadithnumber": 31,
      "arabicnumber": 31,
      "text": "It was narrated from Abu Al-Abbas Sahl bin Sa'd As-Sa'idi (may Allah be pleased with him) that a man came to the Prophet (peace and blessings be upon him) and said: \"O Messenger of Allah! Guide me to a deed that, if I do it, Allah will love me and people will love me.\" He said: \"Be indifferent to the world, and Allah will love you. Be indifferent to what people possess, and people will love you.\"\n\nThis is a hasan hadith. Narrated by Ibn Majah [no. 4102] and others with hasan chains of narration. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 31
      },
      "narration": null
    },
    {
      "hadithnumber": 32,
      "arabicnumber": 32,
      "text": "On the authority of Abu Sa'id Sa'd ibn Malik ibn Sinan al-Khudri, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"There should be neither harming nor reciprocating harm.\"\n\nIt is a hasan hadith, narrated by Ibn Majah [ref: 2341] and Al-Daraqutni [ref: 4/228], and others, as a musnad hadith. Malik narrated it [2/746] in \"Al-Muwatta'\" from 'Amr ibn Yahya from his father from the Prophet, peace and blessings be upon him, as a mursal hadith, omitting Abu Sa'id. It has other chains of narration, some of which strengthen others. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 32
      },
      "narration": null
    },
    {
      "hadithnumber": 33,
      "arabicnumber": 33,
      "text": "It was narrated from Ibn Abbas, may Allah be pleased with them, that the Messenger of Allah, peace and blessings be upon him, said: \"If people were given their claims, men would claim the wealth and blood of people, but the proof is on the claimant, and the oath is on the one who denies.\"\nThis is a hasan hadith, narrated by Al-Bayhaqi [in \"Al-Sunan\" 10/252], and others like it, and part of it is in \"Al-Sahihayn\". [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 33
      },
      "narration": null
    },
    {
      "hadithnumber": 34,
      "arabicnumber": 34,
      "text": "On the authority of Abu Sa'id al-Khudri, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace and blessings be upon him, say: \"Whoever among you sees an evil, let him change it with his hand, and if he cannot, then with his tongue, and if he cannot, then with his heart, and that is the weakest of faith.\" [Narrated by Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 34
      },
      "narration": null
    },
    {
      "hadithnumber": 35,
      "arabicnumber": 35,
      "text": "It was narrated from Abu Hurayrah (may Allah be pleased with him) that the Messenger of Allah (peace and blessings of Allah be upon him) said: \"Do not envy one another, do not bid against one another, do not hate one another, do not turn away from one another, and do not undercut one another in trade. Be, O slaves of Allah, brothers. A Muslim is the brother of a Muslim; he does not wrong him, nor does he humiliate him, nor does he lie to him, nor does he look down on him. Piety is here,\" and he pointed to his chest three times. \"It is enough evil for a man to look down on his Muslim brother. Every Muslim's blood, property, and honor are inviolable to another Muslim.\" [Narrated by Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 35
      },
      "narration": null
    },
    {
      "hadithnumber": 36,
      "arabicnumber": 36,
      "text": "Narrated Abu Huraira, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: \"Whoever relieves a believer of a worldly distress, Allah will relieve him of a distress from the distresses of the Day of Resurrection. Whoever eases the hardship of an indebted person, Allah will ease his hardship in this world and the Hereafter. Whoever covers a Muslim, Allah will cover him in this world and the Hereafter. Allah is in the aid of His servant as long as the servant is in the aid of his brother. Whoever treads a path seeking knowledge, Allah will make for him a path to Paradise easy. No people gather in a house from the houses of Allah, reciting the Book of Allah and studying it among themselves, except that tranquility descends upon them, mercy envelops them, angels surround them, and Allah mentions them among those He has. And whoever's deeds lag behind him, his lineage will not speed him up.\" [Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 36
      },
      "narration": null
    },
    {
      "hadithnumber": 37,
      "arabicnumber": 37,
      "text": "On the authority of Ibn Abbas, may Allah be pleased with them both, from the Messenger of Allah, peace and blessings be upon him, as he narrates from his Lord, the Blessed and Most High, He said: \"Allah has decreed good deeds and bad deeds, and then explained that. Whoever intends to do a good deed and does not do it, Allah will record it with Him as one complete good deed. If he intends to do it and then does it, Allah will record it with Him as ten good deeds, up to seven hundred fold, or even more. Whoever intends to do a bad deed and does not do it, Allah will record it with Him as one complete good deed. If he intends to do it and then does it, Allah will record it as one bad deed.\" [Narrated by Al-Bukhari] and [Muslim], in their Sahih collections, with these words. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 37
      },
      "narration": null
    },
    {
      "hadithnumber": 38,
      "arabicnumber": 38,
      "text": "It was narrated from Abu Hurayrah, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"Allah the Almighty said: 'Whoever shows enmity to a righteous servant of Mine, I shall wage war against him. My servant draws not near to Me with anything more loved by Me than what I have ordained upon him. My servant never ceases to draw near to Me with voluntary acts of worship until I love him. And when I love him, I will be his hearing with which he hears, his sight with which he sees, his hand with which he strikes, and his foot with which he walks. If he asks Me, I will surely give him, and if he seeks refuge in Me, I will surely grant him refuge.'\" [Narrated by Bukhari] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 38
      },
      "narration": null
    },
    {
      "hadithnumber": 39,
      "arabicnumber": 39,
      "text": "It was narrated from Ibn Abbas, may Allah be pleased with them both, that the Messenger of Allah (peace and blessings of Allah be upon him) said: \"Allah has forgiven my Ummah for mistakes, forgetfulness, and what they are forced to do.\"\nThis is a Hasan Hadith, narrated by Ibn Majah [No: 2045] and Al-Bayhaqi in \"Al-Sunan\" (7). [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 39
      },
      "narration": null
    },
    {
      "hadithnumber": 40,
      "arabicnumber": 40,
      "text": "Narrated Ibn `Umar, may Allah be pleased with them: Allah's Messenger (ﷺ) took me by the shoulder and said, \"Be in this world as if you were a stranger or a traveller on the road.\" Ibn `Umar, may Allah be pleased with them, used to say: \"When you wake up in the morning, do not wait for the evening, and when you wake up in the evening, do not wait for the morning. Take advantage of your health before you fall ill, and take advantage of your life before death.\" [Bukhari] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 40
      },
      "narration": null
    },
    {
      "hadithnumber": 41,
      "arabicnumber": 41,
      "text": "From Abu Muhammad Abdullah bin Amr bin Al-As, may Allah be pleased with them both, he said: The Messenger of Allah, peace and blessings be upon him, said: \"None of you truly believes until his desires are in accordance with what I have brought.\"\nThis is a Hasan Sahih hadith, narrated in the book of \"Al-Hujjah\" with a Sahih chain of narration. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 41
      },
      "narration": null
    },
    {
      "hadithnumber": 42,
      "arabicnumber": 42,
      "text": "Anas bin Malik, may Allah be pleased with him, narrated that he heard the Messenger of Allah (peace and blessings be upon him) say: Allah the Almighty said, \"O son of Adam! As long as you call upon Me and hope in Me, I shall forgive you for what you have done, and I shall not mind. O son of Adam! If your sins reached the sky, then you sought forgiveness from Me, I would forgive you. O son of Adam! If you came to Me with sins nearly filling the earth, and then you met Me without associating anything with Me, I would bring you forgiveness nearly filling the earth.\"\n\nReported by Tirmidhi [No: 3540], who said: This is a Hasan Sahih hadith. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 42
      },
      "narration": null
    }
  ],
  "metadata": {
    "sections": {},
    "section_details": {}
  }
}