{
  "hadiths": [
    {
      "hadithnumber": 1,
      "arabicnumber": 1,
      "text": "Dari Amirul Mukminin Abu Hafsh Umar bin Al-Khattab radhiyallahu anhu, ia berkata: Aku mendengar Rasulullah shallallahu alaihi wasallam bersabda: \"Sesungguhnya segala amal perbuatan tergantung pada niatnya, dan sesungguhnya setiap orang akan mendapatkan balasan sesuai dengan apa yang ia niatkan. Maka barangsiapa yang hijrahnya karena (mencari keridhaan) Allah dan Rasul-Nya, maka hijrahnya adalah karena (mencari keridhaan) Allah dan Rasul-Nya. Dan barangsiapa yang hijrahnya karena dunia yang ingin ia dapatkan atau karena seorang wanita yang ingin ia nikahi, maka hijrahnya adalah karena apa yang ia hijrahkan.\"\nDiriwayatkan oleh dua imam ahli hadits, Abu Abdillah Muhammad bin Ismail bin Ibrahim bin Al-Mughirah bin Bardizbah Al-Bukhari Al-Ju'fi [No: 1], dan Abu Al-Husain Muslim bin Al-Hajjaj bin Muslim Al-Qusyairi An-Naisaburi [No: 1907], radhiyallahu anhuma, dalam Shahihain mereka yang merupakan dua kitab tershahih yang tersusun. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 1
      },
      "narration": null
    },
    {
      "hadithnumber": 2,
      "arabicnumber": 2,
      "text": "Dari Umar radhiyallahu 'anhu juga berkata: \"Suatu hari ketika kami sedang duduk di sisi Rasulullah shallallahu 'alaihi wa sallam, tiba-tiba datang seorang laki-laki yang pakaiannya sangat putih, rambutnya sangat hitam, tidak terlihat bekas perjalanan padanya, dan tidak ada seorang pun di antara kami yang mengenalnya. Sampai ia duduk di dekat Nabi shallallahu 'alaihi wa sallam. Lalu ia menempelkan kedua lututnya ke lutut Nabi shallallahu 'alaihi wa sallam, dan meletakkan kedua telapak tangannya di atas pahanya, lalu berkata: \"Wahai Muhammad, beritahu aku tentang Islam.\" Maka Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Islam adalah engkau bersaksi bahwa tidak ada ilah selain Allah dan bahwa Muhammad adalah utusan Allah, engkau mendirikan shalat, menunaikan zakat, berpuasa Ramadhan, dan menunaikan haji ke Baitullah jika engkau mampu.\" Ia berkata: \"Engkau benar.\" Kami pun takjub, ia bertanya lalu ia membenarkannya! Ia berkata: \"Beritahu aku tentang Iman.\" Nabi shallallahu 'alaihi wa sallam bersabda: \"Engkau beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya, Hari Kiamat, dan engkau beriman kepada takdir baik dan buruknya.\" Ia berkata: \"Engkau benar.\" Ia berkata: \"Beritahu aku tentang Ihsan.\" Nabi shallallahu 'alaihi wa sallam bersabda: \"Engkau beribadah kepada Allah seolah-olah engkau melihat-Nya, maka jika engkau tidak melihat-Nya, sesungguhnya Dia melihatmu.\" Ia berkata: \"Beritahu aku tentang Kiamat.\" Nabi shallallahu 'alaihi wa sallam bersabda: \"Yang ditanya tentangnya tidak lebih tahu daripada yang bertanya.\" Ia berkata: \"Beritahu aku tentang tanda-tandanya?\" Nabi shallallahu 'alaihi wa sallam bersabda: \"Ketika seorang budak wanita melahirkan tuannya, dan ketika engkau melihat orang-orang yang tidak beralas kaki, telanjang, dan fakir, penggembala kambing, berlomba-lomba membangun bangunan.\" Kemudian ia pergi. Aku pun terdiam cukup lama. Lalu Nabi shallallahu 'alaihi wa sallam bersabda: \"Wahai Umar, tahukah engkau siapa yang bertanya tadi?\" Aku berkata: \"Allah dan Rasul-Nya lebih tahu.\" Nabi shallallahu 'alaihi wa sallam bersabda: \"Sesungguhnya ia adalah Jibril, ia datang kepada kalian untuk mengajarkan kepada kalian agama kalian.\" [HR. Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 2
      },
      "narration": null
    },
    {
      "hadithnumber": 3,
      "arabicnumber": 3,
      "text": "Dari Abu Abdurrahman Abdullah bin Umar bin Khattab radhiyallahu anhuma, ia berkata: Aku mendengar Rasulullah shallallahu alaihi wa sallam bersabda: \"Islam dibangun di atas lima perkara: bersaksi bahwa tidak ada ilah selain Allah dan bahwa Muhammad adalah utusan Allah, mendirikan shalat, menunaikan zakat, menunaikan haji ke Baitullah, dan berpuasa di bulan Ramadhan.\" (Diriwayatkan oleh Bukhari dan Muslim). [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 3
      },
      "narration": null
    },
    {
      "hadithnumber": 4,
      "arabicnumber": 4,
      "text": "Dari Abu Abdurrahman Abdullah bin Mas'ud radhiyallahu 'anhu, beliau berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda kepada kami, dan beliau adalah orang yang jujur dan dibenarkan, \"Sesungguhnya salah seorang dari kalian dikumpulkan penciptaannya dalam perut ibunya selama empat puluh hari sebagai nuthfah (air mani), kemudian menjadi segumpal darah (alaqah) seperti itu pula, kemudian menjadi segumpal daging (mudghah) seperti itu pula. Kemudian diutuslah malaikat kepadanya lalu meniupkan ruh ke dalamnya, dan diperintahkan untuk menulis empat kalimat: menulis rezekinya, ajalnya, amalnya, dan celaka atau bahagia. Demi Allah yang tiada Tuhan selain-Nya, sesungguhnya salah seorang dari kalian benar-benar beramal dengan amalan ahli surga hingga jarak antara dirinya dan surga tinggal sejengkal, lalu takdir mendahuluinya sehingga ia beramal dengan amalan ahli neraka lalu masuk neraka. Dan sesungguhnya salah seorang dari kalian benar-benar beramal dengan amalan ahli neraka hingga jarak antara dirinya dan neraka tinggal sejengkal, lalu takdir mendahuluinya sehingga ia beramal dengan amalan ahli surga lalu masuk surga.\" [Diriwayatkan oleh Bukhari] dan [Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 4
      },
      "narration": null
    },
    {
      "hadithnumber": 5,
      "arabicnumber": 5,
      "text": "Dari Ummu Al-Mu'minin, Ummu 'Abdillah 'Aisyah radhiyallahu 'anha, beliau berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda, \"Barangsiapa mengada-adakan dalam urusan kami ini apa yang bukan darinya, maka ia tertolak.\" [Diriwayatkan oleh Al-Bukhari] [dan Muslim] Dan dalam riwayat Muslim: \"Barangsiapa melakukan suatu amal yang tidak atas perintah kami, maka ia tertolak.\" [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 5
      },
      "narration": null
    },
    {
      "hadithnumber": 6,
      "arabicnumber": 6,
      "text": "Dari Abu Abdillah An-Nu'man bin Basyir radhiyallahu 'anhuma, ia berkata: Aku mendengar Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Sesungguhnya yang halal itu jelas, dan sesungguhnya yang haram itu jelas, dan di antara keduanya ada perkara-perkara yang syubhat (samar-samar) yang tidak diketahui oleh kebanyakan orang. Maka barangsiapa yang berhati-hati dari perkara-perkara yang syubhat, berarti ia telah menjaga agama dan kehormatannya. Dan barangsiapa yang jatuh pada perkara-perkara yang syubhat, maka ia telah jatuh pada yang haram. Seperti penggembala yang menggembala di sekitar tanah terlarang, hampir saja ia memasukinya. Ketahuilah, sesungguhnya setiap raja memiliki tanah terlarang, dan ketahuilah sesungguhnya tanah terlarang Allah adalah larangan-Nya. Ketahuilah, sesungguhnya dalam tubuh itu ada segumpal daging. Jika ia baik, maka baiklah seluruh tubuh, dan jika ia buruk, maka buruklah seluruh tubuh. Ketahuilah, segumpal daging itu adalah hati.\" (HR. Bukhari dan Muslim) [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 6
      },
      "narration": null
    },
    {
      "hadithnumber": 7,
      "arabicnumber": 7,
      "text": "Dari Abu Ruqayyah Tamim bin Aus Ad-Dari radhiyallahu 'anhu bahwa Nabi shallallahu 'alaihi wa sallam bersabda: \"Agama adalah nasehat.\" Kami bertanya: \"Untuk siapa?\" Beliau bersabda: \"Untuk Allah, Kitab-Nya, Rasul-Nya, para pemimpin kaum Muslimin dan kaum Muslimin pada umumnya.\" [HR. Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 7
      },
      "narration": null
    },
    {
      "hadithnumber": 8,
      "arabicnumber": 8,
      "text": "Dari Ibnu Umar radhiyallahu anhuma, bahwa Rasulullah shallallahu alaihi wa sallam bersabda: \"Aku diperintahkan untuk memerangi manusia sampai mereka bersaksi bahwa tidak ada ilah selain Allah dan bahwa Muhammad adalah utusan Allah, mendirikan shalat, dan menunaikan zakat; maka apabila mereka telah melakukan itu, mereka telah melindungi darah dan harta mereka dariku, kecuali dengan hak Islam, dan perhitungan mereka ada pada Allah Ta'ala.\" [Diriwayatkan oleh Bukhari], [dan Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 8
      },
      "narration": null
    },
    {
      "hadithnumber": 9,
      "arabicnumber": 9,
      "text": "Dari Abu Hurairah Abdurrahman bin Shakhr radhiyallahu anhu, ia berkata: Aku mendengar Rasulullah shallallahu alaihi wasallam bersabda, \"Apa yang aku larang bagimu, maka jauhilah ia, dan apa yang aku perintahkan kepadamu, maka lakukanlah dari padanya semampu kamu. Sesungguhnya yang membinasakan orang-orang sebelum kamu adalah banyaknya pertanyaan mereka dan perselisihan mereka terhadap para nabi mereka.\" [Diriwayatkan oleh Bukhari], [dan Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 9
      },
      "narration": null
    },
    {
      "hadithnumber": 10,
      "arabicnumber": 10,
      "text": "Dari Abu Hurairah radhiyallahu 'anhu, ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda, \"Sesungguhnya Allah Maha Baik, tidak menerima kecuali yang baik. Dan sesungguhnya Allah memerintahkan orang-orang beriman sebagaimana Dia memerintahkan para rasul, lalu Dia berfirman: \"Wahai para rasul, makanlah dari yang baik-baik dan beramallah saleh.\" Dan Dia berfirman: \"Wahai orang-orang yang beriman, makanlah dari rezeki yang baik-baik yang telah Kami rezekikan kepadamu.\" Kemudian beliau menyebutkan seorang laki-laki yang melakukan perjalanan jauh, rambutnya kusut dan berdebu, ia mengangkat kedua tangannya ke langit, seraya berdoa: \"Ya Rabb! Ya Rabb!\" Sementara makanannya haram, minumannya haram, pakaiannya haram, dan ia diberi makan dari yang haram, maka bagaimana doanya dikabulkan?\" [HR. Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 10
      },
      "narration": null
    },
    {
      "hadithnumber": 11,
      "arabicnumber": 11,
      "text": "Dari Abu Muhammad, Al-Hasan bin Ali bin Abi Thalib, cucu Rasulullah shallallahu 'alaihi wa sallam dan kesayangannya, radhiallahu 'anhuma, ia berkata: Aku menghafal dari Rasulullah shallallahu 'alaihi wa sallam (sabda): \"Tinggalkanlah apa yang meragukanmu menuju apa yang tidak meragukanmu\". Hadis ini diriwayatkan oleh Tirmidzi [nomor: 2520], dan An-Nasa'i. Tirmidzi berkata: Hadis hasan shahih. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 11
      },
      "narration": null
    },
    {
      "hadithnumber": 12,
      "arabicnumber": 12,
      "text": "Dari Abu Hurairah radhiyallahu 'anhu, ia berkata, Rasulullah shallallahu 'alaihi wa sallam bersabda, \"Termasuk keindahan keislaman seseorang adalah dia meninggalkan apa yang tidak bermanfaat baginya.\"\nHadits hasan, diriwayatkan oleh At-Tirmidzi [nomor: 2318], Ibnu Majah [nomor: 3976]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 12
      },
      "narration": null
    },
    {
      "hadithnumber": 13,
      "arabicnumber": 13,
      "text": "Dari Abu Hamzah Anas bin Malik radhiyallahu 'anhu, pelayan Rasulullah shallallahu 'alaihi wa sallam, dari Nabi shallallahu 'alaihi wa sallam bersabda: \"Tidak beriman salah seorang dari kalian hingga ia mencintai untuk saudaranya apa yang ia cintai untuk dirinya sendiri\".\nDiriwayatkan oleh Al-Bukhari [nomor:13], dan Muslim [nomor:45]. [Diriwayatkan oleh Al-Bukhari], [dan Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 13
      },
      "narration": null
    },
    {
      "hadithnumber": 14,
      "arabicnumber": 14,
      "text": "Dari Ibnu Mas'ud radhiyallahu 'anhu berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda, \"Darah seorang muslim tidak halal kecuali dengan salah satu dari tiga perkara: seorang duda yang berzina, jiwa dibalas jiwa, dan orang yang meninggalkan agamanya yang memisahkan diri dari jamaah.\" [Diriwayatkan oleh Bukhari], [dan Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 14
      },
      "narration": null
    },
    {
      "hadithnumber": 15,
      "arabicnumber": 15,
      "text": "Dari Abu Hurairah radhiyallahu anhu, bahwa Rasulullah shallallahu alaihi wa sallam bersabda: \"Barangsiapa beriman kepada Allah dan hari akhir, maka hendaklah ia berkata baik atau diam, dan barangsiapa beriman kepada Allah dan hari akhir, maka hendaklah ia memuliakan tetangganya, dan barangsiapa beriman kepada Allah dan hari akhir, maka hendaklah ia memuliakan tamunya.\" [Bukhari], [Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 15
      },
      "narration": null
    },
    {
      "hadithnumber": 16,
      "arabicnumber": 16,
      "text": "Dari Abu Hurairah radhiyallahu 'anhu, bahwa seorang pria berkata kepada Nabi shallallahu 'alaihi wa sallam: \"Nasihatilah aku.\" Beliau bersabda: \"Jangan marah.\" Ia mengulangi permintaan itu berulang kali. Beliau bersabda: \"Jangan marah.\" [Diriwayatkan oleh Bukhari] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 16
      },
      "narration": null
    },
    {
      "hadithnumber": 17,
      "arabicnumber": 17,
      "text": "Dari Abu Ya'la Syaddad bin Aus radhiyallahu 'anhu dari Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Sesungguhnya Allah mewajibkan berbuat baik atas segala sesuatu. Apabila kalian membunuh, maka bunuhlah dengan baik, dan apabila kalian menyembelih, maka sembelihlah dengan baik. Hendaklah salah seorang dari kalian menajamkan pisaunya dan menyenangkan hewan sembelihannya.\" [Diriwayatkan oleh Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 17
      },
      "narration": null
    },
    {
      "hadithnumber": 18,
      "arabicnumber": 18,
      "text": "Dari Abu Dzar Jundab bin Junadah dan Abu Abdurrahman Muadz bin Jabal radhiyallahu 'anhuma, dari Rasulullah shallallahu 'alaihi wa sallam bersabda: \"Bertakwalah kepada Allah di mana pun engkau berada, dan ikutilah keburukan dengan kebaikan, niscaya kebaikan itu akan menghapuskannya, dan bergaullah dengan manusia dengan akhlak yang baik.\" Riwayat Tirmidzi [no: 1987] dan ia berkata: Hadits hasan, dan dalam sebagian naskah: hasan shahih. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 18
      },
      "narration": null
    },
    {
      "hadithnumber": 19,
      "arabicnumber": 19,
      "text": "Dari Abdullah bin Abbas radhiyallahu anhuma, beliau berkata: \"Suatu hari aku berada di belakang Rasulullah shallallahu 'alaihi wa sallam, maka beliau bersabda: 'Wahai anak muda! Aku akan mengajarkanmu beberapa kalimat: Jagalah Allah, niscaya Dia menjagamu. Jagalah Allah, niscaya Engkau mendapati-Nya bersamamu. Jika engkau memohon, mohonlah kepada Allah. Jika engkau meminta pertolongan, mintalah pertolongan kepada Allah. Ketahuilah bahwa seandainya seluruh umat berkumpul untuk memberimu manfaat dengan sesuatu, mereka tidak akan bisa memberimu manfaat kecuali dengan sesuatu yang telah Allah tetapkan untukmu. Dan jika mereka berkumpul untuk menimpakan mudharat kepadamu dengan sesuatu, mereka tidak akan bisa menimpakan mudharat kecuali dengan sesuatu yang telah Allah tetapkan atasmu. Pena telah diangkat dan lembaran telah kering.' (Diriwayatkan oleh Tirmidzi [no:2516] dan beliau berkata: Hadits hasan shahih).\n\nDalam riwayat selain Tirmidzi: 'Jagalah Allah, niscaya Engkau mendapati-Nya di depanmu. Kenalilah Allah di saat lapang, niscaya Dia mengenalmu di saat sulit. Ketahuilah bahwa apa yang luput darimu tidak akan menimpamu, dan apa yang menimpamu tidak akan luput darimu. Ketahuilah bahwa pertolongan datang bersama kesabaran, bahwa kelapangan datang bersama kesulitan, dan bahwa bersama kesulitan ada kemudahan.'\" [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 19
      },
      "narration": null
    },
    {
      "hadithnumber": 20,
      "arabicnumber": 20,
      "text": "Dari Abu Mas'ud Uqbah bin Amr Al-Anshari Al-Badri radhiyallahu anhu berkata: Rasulullah shallallahu alaihi wa sallam bersabda, \"Sesungguhnya di antara perkataan kenabian terdahulu yang dipahami orang-orang adalah: Jika engkau tidak malu, maka lakukanlah sesukamu.\" [HR. Bukhari] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 20
      },
      "narration": null
    },
    {
      "hadithnumber": 21,
      "arabicnumber": 21,
      "text": "Dari Abu Amr, dan dikatakan Abu Amrah Sufyan bin Abdullah radhiyallahu anhu, ia berkata: \"Aku berkata: Wahai Rasulullah, katakan kepadaku tentang Islam sebuah perkataan yang aku tidak akan bertanya kepada siapapun selain engkau. Beliau bersabda: Katakanlah: Aku beriman kepada Allah, kemudian istiqamahlah.\" [Diriwayatkan oleh Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 21
      },
      "narration": null
    },
    {
      "hadithnumber": 22,
      "arabicnumber": 22,
      "text": "Dari Abu Abdillah Jabir bin Abdullah Al-Anshari radhiyallahu anhuma, ia berkata: \"Seorang pria bertanya kepada Rasulullah shallallahu 'alaihi wa sallam, 'Bagaimana pendapatmu jika aku mengerjakan shalat wajib, puasa Ramadhan, menghalalkan yang halal, mengharamkan yang haram, dan tidak menambah sesuatu pun dari itu; apakah aku akan masuk surga?' Beliau bersabda, 'Ya'.\" [HR. Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 22
      },
      "narration": null
    },
    {
      "hadithnumber": 23,
      "arabicnumber": 23,
      "text": "Dari Abu Malik Al-Harits bin Ashim Al-Asy'ari radhiyallahu 'anhu, ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda, \"Bersuci itu separuh iman, ucapan alhamdulillah memenuhi timbangan, ucapan subhanallah dan alhamdulillah memenuhi atau memenuhi - atau: memenuhi - antara langit dan bumi, shalat adalah cahaya, sedekah adalah bukti, sabar adalah sinar, dan Al-Qur'an adalah hujjah bagimu atau melawanmu. Setiap orang berpagi-pagi, maka ada yang menjual dirinya lalu memerdekakannya atau mencelakakannya.\" [HR. Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 23
      },
      "narration": null
    },
    {
      "hadithnumber": 24,
      "arabicnumber": 24,
      "text": "Dari Abu Dzar Al-Ghifari radhiyallahu anhu, dari Nabi shallallahu alaihi wasallam dalam riwayat dari Tuhannya yang Maha Suci lagi Maha Tinggi, bahwa Dia berfirman: \"Wahai hamba-hamba-Ku: Sesungguhnya Aku mengharamkan kezaliman atas diri-Ku, dan menjadikannya haram di antara kalian; maka janganlah kalian saling menzalimi. Wahai hamba-hamba-Ku! Kalian semua tersesat kecuali yang Aku beri petunjuk, maka mintalah petunjuk kepada-Ku, niscaya Aku akan memberi petunjuk kepadamu. Wahai hamba-hamba-Ku! Kalian semua lapar kecuali yang Aku beri makan, maka mintalah makanan kepada-Ku, niscaya Aku akan memberimu makan. Wahai hamba-hamba-Ku! Kalian semua telanjang kecuali yang Aku beri pakaian, maka mintalah pakaian kepada-Ku, niscaya Aku akan memakaikan pakaian kepadamu. Wahai hamba-hamba-Ku! Sesungguhnya kalian berbuat kesalahan di malam dan siang hari, dan Aku mengampuni semua dosa; maka mintalah ampun kepada-Ku, niscaya Aku akan mengampunimu. Wahai hamba-hamba-Ku! Sesungguhnya kalian tidak akan dapat menimpakan mudarat kepada-Ku sehingga kalian memudaratkan-Ku, dan kalian tidak akan dapat menimpakan manfaat kepada-Ku sehingga kalian memberi manfaat kepada-Ku. Wahai hamba-hamba-Ku! Sekiranya orang-orang yang terdahulu dan yang kemudian dari kalian, serta manusia dan jin kalian, berada di atas hati yang paling bertakwa dari satu orang di antara kalian, hal itu tidak akan menambah kerajaan-Ku sedikit pun. Wahai hamba-hamba-Ku! Sekiranya orang-orang yang terdahulu dan yang kemudian dari kalian, serta manusia dan jin kalian, berada di atas hati yang paling durhaka dari satu orang di antara kalian, hal itu tidak akan mengurangi kerajaan-Ku sedikit pun. Wahai hamba-hamba-Ku! Sekiranya orang-orang yang terdahulu dan yang kemudian dari kalian, serta manusia dan jin kalian, berdiri di satu tempat, lalu mereka meminta kepada-Ku, lalu Aku memberikan kepada setiap orang apa yang dimintanya, hal itu tidak akan mengurangi apa yang ada di sisi-Ku kecuali sebagaimana berkurangnya jarum jika dimasukkan ke dalam lautan. Wahai hamba-hamba-Ku! Sesungguhnya itu adalah amal perbuatan kalian, Aku menghitungnya untuk kalian, kemudian Aku membalasnya untuk kalian; maka barangsiapa menemukan kebaikan, hendaklah ia memuji Allah, dan barangsiapa menemukan selain itu, maka janganlah ia mencela kecuali dirinya sendiri.\" [Diriwayatkan oleh Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 24
      },
      "narration": null
    },
    {
      "hadithnumber": 25,
      "arabicnumber": 25,
      "text": "Dari Abu Dzar radhiyallahu anhu, ia berkata: \"Beberapa orang dari sahabat Rasulullah shallallahu 'alaihi wa sallam berkata kepada Nabi shallallahu 'alaihi wa sallam: 'Wahai Rasulullah, orang-orang kaya telah membawa pahala. Mereka shalat sebagaimana kami shalat, berpuasa sebagaimana kami berpuasa, dan bersedekah dengan kelebihan harta mereka.' Beliau bersabda: 'Bukankah Allah telah menjadikan sesuatu yang dapat kamu sedekahkan? Sesungguhnya setiap tasbih adalah sedekah, setiap takbir adalah sedekah, setiap tahmid adalah sedekah, setiap tahlil adalah sedekah, amar ma'ruf adalah sedekah, nahi munkar adalah sedekah, dan hubungan seksual salah seorang dari kalian adalah sedekah.' Mereka berkata: 'Wahai Rasulullah, apakah salah seorang dari kami mendatangi syahwatnya lalu ia mendapatkan pahala?' Beliau bersabda: 'Tahukah kalian, jika ia menaruhnya pada sesuatu yang haram, apakah ia akan menanggung dosa? Demikian pula, jika ia menaruhnya pada sesuatu yang halal, maka ia akan mendapatkan pahala.'\" [Diriwayatkan oleh Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 25
      },
      "narration": null
    },
    {
      "hadithnumber": 26,
      "arabicnumber": 26,
      "text": "Dari Abu Hurairah radhiyallahu anhu, ia berkata: Rasulullah shallallahu alaihi wa sallam bersabda, \"Setiap ruas tulang manusia dikenai sedekah setiap hari ketika matahari terbit. Mendamaikan antara dua orang adalah sedekah, membantu seseorang naik ke kendaraannya lalu menaikkannya atau mengangkatkan barangnya untuknya adalah sedekah, ucapan yang baik adalah sedekah, setiap langkah yang kamu lakukan untuk shalat adalah sedekah, dan menyingkirkan gangguan dari jalan adalah sedekah.\" [Diriwayatkan oleh Bukhari], [dan Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 26
      },
      "narration": null
    },
    {
      "hadithnumber": 27,
      "arabicnumber": 27,
      "text": "Dari An-Nawwas bin Sam'an radhiyallahu anhu, dari Nabi shallallahu alaihi wa sallam, beliau bersabda: \"Kebaikan adalah akhlak yang baik, dan dosa adalah sesuatu yang mengganjal di hatimu, dan kamu tidak suka orang lain mengetahuinya.\" (HR. Muslim)\n\nDan dari Wabishah bin Ma'bad radhiyallahu anhu, ia berkata: Aku mendatangi Rasulullah shallallahu alaihi wa sallam, lalu beliau bersabda: \"Engkau datang bertanya tentang kebaikan? Aku berkata: Ya. Beliau bersabda: Mintalah fatwa kepada hatimu, kebaikan adalah sesuatu yang jiwa dan hati merasa tenteram dengannya, dan dosa adalah sesuatu yang mengganjal di jiwa dan berbolak-balik di dada, meskipun orang-orang memberikan fatwa kepadamu.\"\n\nHadits hasan, diriwayatkan dalam Musnad Imam Ahmad bin Hanbal [no: 4/227] dan Ad-Darimi [2/246] dengan sanad hasan. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 27
      },
      "narration": null
    },
    {
      "hadithnumber": 28,
      "arabicnumber": 28,
      "text": "Dari Abu Najih Al-Irbadh bin Sariyah, semoga Allah meridaminya, ia berkata: \"Rasulullah shallallahu 'alaihi wa sallam memberikan kami nasihat yang membuat hati bergetar dan mata berlinang. Kami berkata: 'Wahai Rasulullah, seolah-olah ini adalah nasihat perpisahan. Berilah kami wasiat!' Beliau bersabda: 'Aku wasiatkan kepada kalian untuk bertakwa kepada Allah, mendengar dan patuh, meskipun yang memimpin kalian adalah seorang budak. Sesungguhnya barangsiapa di antara kalian yang hidup, ia akan melihat banyak perselisihan. Maka peganglah sunnahku dan sunnah para Khulafa Ar-Rasyidin yang mendapat petunjuk. Gigitlah dengan gigi gerahammu. Dan berhati-hatilah dengan perkara-perkara yang baru, karena setiap bid'ah adalah kesesatan.\" [Diriwayatkan oleh Abu Daud] dan At-Tirmidzi [Nomor: 266] dan ia berkata: Hadits hasan shahih. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 28
      },
      "narration": null
    },
    {
      "hadithnumber": 29,
      "arabicnumber": 29,
      "text": "Dari Muadz bin Jabal radhiyallahu anhu berkata, \"Aku berkata, 'Wahai Rasulullah, beritahulah aku amal yang memasukkanku ke surga dan menjauhkanku dari neraka.' Beliau bersabda, 'Sungguh engkau telah bertanya tentang perkara yang agung, dan sesungguhnya hal itu mudah bagi siapa saja yang Allah mudahkan baginya: engkau beribadah kepada Allah dan tidak menyekutukan-Nya dengan sesuatu pun, mendirikan shalat, menunaikan zakat, berpuasa di bulan Ramadhan, dan menunaikan haji ke Baitullah.' Kemudian beliau bersabda, 'Maukah aku tunjukkan kepadamu pintu-pintu kebaikan? Puasa adalah perisai, sedekah memadamkan kesalahan sebagaimana air memadamkan api, dan shalat seseorang di tengah malam.' Kemudian beliau membaca, 'Lambung mereka jauh dari tempat tidur...' hingga firman-Nya, 'mereka mengerjakan.' (QS. As-Sajdah: 16-17). Kemudian beliau bersabda, 'Maukah aku beritahukan kepadamu pokok dari segala perkara, tiangnya, dan puncak tertingginya?' Aku berkata, 'Tentu, wahai Rasulullah.' Beliau bersabda, 'Pokok segala perkara adalah Islam, tiangnya adalah shalat, dan puncak tertingginya adalah jihad.' Kemudian beliau bersabda, 'Maukah aku beritahukan kepadamu kunci dari semua itu?' Aku berkata, 'Tentu, wahai Rasulullah!' Maka beliau memegang lisannya dan berkata, 'Tahanlah ini.' Aku berkata, 'Wahai Nabi Allah, apakah kita akan diadzab karena apa yang kita ucapkan?' Beliau bersabda, 'Semoga ibumu kehilanganmu, tidaklah orang-orang tersungkur di wajah mereka—atau beliau bersabda: di hidung mereka—kecuali karena hasil panen lisan mereka!'\"\nDiriwayatkan oleh Tirmidzi [no:2616] dan berkata: Hadits hasan shahih. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 29
      },
      "narration": null
    },
    {
      "hadithnumber": 30,
      "arabicnumber": 30,
      "text": "Dari Abu Tsalabah Al-Khusyani, Jurtsum bin Nasyr, semoga Allah meridhainya, dari Rasulullah shallallahu 'alaihi wa sallam, beliau bersabda: \"Sesungguhnya Allah Ta'ala mewajibkan kewajiban-kewajiban, maka janganlah kalian menyia-nyiakannya, dan menetapkan batasan-batasan, maka janganlah kalian melampauinya, dan mengharamkan sesuatu, maka janganlah kalian melanggarnya, dan Dia mendiamkan beberapa perkara sebagai rahmat bagi kalian, bukan karena lupa, maka janganlah kalian mencari-carinya.\" Hadits hasan, diriwayatkan oleh Ad-Daraquthni dalam Sunannya [4/184], dan selainnya. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 30
      },
      "narration": null
    },
    {
      "hadithnumber": 31,
      "arabicnumber": 31,
      "text": "Dari Abu Al-Abbas Sahl bin Sa'd As-Sa'idi radhiyallahu 'anhu berkata: Datang seorang laki-laki kepada Nabi shallallahu 'alaihi wa sallam, lalu berkata: \"Wahai Rasulullah! Tunjukkanlah kepadaku suatu amal, jika aku mengerjakannya, niscaya Allah akan mencintaiku dan manusia akan mencintaiku.\" Maka beliau bersabda: \"Berzuhudlah (tinggalkan) urusan dunia, niscaya Allah mencintaimu. Dan berzuhudlah (tinggalkan) apa yang ada pada manusia, niscaya manusia akan mencintaimu.\" [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 31
      },
      "narration": null
    },
    {
      "hadithnumber": 32,
      "arabicnumber": 32,
      "text": "Dari Abu Said Sa'ad bin Malik bin Sinan Al-Khudri radhiyallahu anhu bahwa Rasulullah shallallahu alaihi wa sallam bersabda: \"Tidak boleh membahayakan diri sendiri dan tidak boleh membahayakan orang lain.\"\nHadis hasan, diriwayatkan oleh Ibnu Majah [lihat no: 2341], Ad-Daruquthni [no: 4/228], dan lainnya secara musnad. Diriwayatkan oleh Malik [2/746] dalam \"Al-Muwatha\" dari Amru bin Yahya dari ayahnya dari Nabi shallallahu alaihi wa sallam secara mursal, maka ia menggugurkan Abu Said, dan hadis ini memiliki beberapa jalur periwayatan yang sebagian menguatkan sebagian yang lain. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 32
      },
      "narration": null
    },
    {
      "hadithnumber": 33,
      "arabicnumber": 33,
      "text": "Dari Ibnu Abbas radhiyallahu anhuma, bahwa Rasulullah shallallahu alaihi wasallam bersabda: \"Seandainya manusia diberi apa yang mereka klaim, niscaya orang-orang akan mengklaim harta dan darah kaum lain, tetapi bukti dibebankan kepada penggugat, dan sumpah dibebankan kepada yang mengingkarinya.\"\nHadis hasan, diriwayatkan oleh Al-Baihaqi [dalam \"As-Sunan\" 10/252], dan lainnya demikian, sebagiannya ada dalam \"Shahihain\". [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 33
      },
      "narration": null
    },
    {
      "hadithnumber": 34,
      "arabicnumber": 34,
      "text": "Dari Abu Sa'id Al-Khudri radhiyallahu anhu berkata, aku mendengar Rasulullah shallallahu alaihi wasallam bersabda: \"Siapa di antara kalian yang melihat kemungkaran, maka ubahlah dengan tangannya. Jika tidak mampu, maka ubahlah dengan lisannya. Jika tidak mampu, maka ubahlah dengan hatinya, dan itu adalah selemah-lemah iman.\" [HR. Muslim] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 34
      },
      "narration": null
    },
    {
      "hadithnumber": 35,
      "arabicnumber": 35,
      "text": "Dari Abu Hurairah radhiyallahu 'anhu, ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda, \"Janganlah kalian saling hasad, janganlah saling menawar barang yang sudah ditawar orang lain (najasy), janganlah saling membenci, janganlah saling membelakangi, dan janganlah sebagian kalian menjual atas dagangan sebagian yang lain. Jadilah kalian hamba Allah bersaudara. Seorang Muslim adalah saudara bagi Muslim lainnya, ia tidak menzaliminya, tidak menghinakannya, tidak mendustainya, dan tidak merendahkannya. Takwa itu di sini,\" beliau menunjuk dadanya tiga kali. \"Cukuplah keburukan seseorang jika ia merendahkan saudara Muslimnya. Setiap Muslim atas Muslim lainnya haram: darahnya, hartanya, dan kehormatannya.\" [Diriwayatkan oleh Muslim]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 35
      },
      "narration": null
    },
    {
      "hadithnumber": 36,
      "arabicnumber": 36,
      "text": "Dari Abu Hurairah radhiyallahu anhu, dari Nabi shallallahu alaihi wa sallam, beliau bersabda: \"Siapa yang melepaskan kesusahan seorang mukmin dari kesusahan-kesusahan dunia, Allah akan melepaskan kesusahannya dari kesusahan-kesusahan hari kiamat. Siapa yang mempermudah orang yang kesulitan, Allah akan mempermudah baginya di dunia dan akhirat. Siapa yang menutupi aib seorang muslim, Allah akan menutupi aibnya di dunia dan akhirat. Allah senantiasa menolong seorang hamba selama hamba itu menolong saudaranya. Siapa yang menempuh suatu jalan untuk mencari ilmu, Allah akan memudahkan baginya jalan ke surga. Dan tidaklah berkumpul suatu kaum di salah satu rumah Allah sambil membaca kitab Allah dan mempelajarinya di antara mereka, melainkan turun kepada mereka ketenangan, diliputi rahmat, dikelilingi malaikat, dan Allah menyebut mereka pada orang-orang yang ada di sisi-Nya. Dan siapa yang lambat amalnya, tidak akan dipercepat oleh nasabnya.\" [HR. Muslim dengan lafazh ini] [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 36
      },
      "narration": null
    },
    {
      "hadithnumber": 37,
      "arabicnumber": 37,
      "text": "Dari Ibnu Abbas radhiyallahu anhuma, dari Rasulullah shallallahu alaihi wa sallam, sebagaimana yang beliau riwayatkan dari Tuhannya yang Maha Suci dan Maha Tinggi, Dia berfirman: \"Sesungguhnya Allah mencatat kebaikan-kebaikan dan keburukan-keburukan, lalu Dia menjelaskannya. Barangsiapa berniat melakukan kebaikan lalu tidak melakukannya, maka Allah mencatatnya di sisi-Nya sebagai satu kebaikan yang sempurna. Dan jika ia berniat melakukan kebaikan lalu mengerjakannya, maka Allah mencatatnya di sisi-Nya sepuluh kebaikan sampai tujuh ratus kali lipat hingga kelipatan yang banyak. Dan jika ia berniat melakukan keburukan lalu tidak melakukannya, maka Allah mencatatnya di sisi-Nya sebagai satu kebaikan yang sempurna. Dan jika ia berniat melakukan keburukan lalu mengerjakannya, maka Allah mencatatnya sebagai satu keburukan.\" (Diriwayatkan oleh Bukhari, dan Muslim, dalam Shahih mereka dengan lafadz ini.) [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 37
      },
      "narration": null
    },
    {
      "hadithnumber": 38,
      "arabicnumber": 38,
      "text": "Dari Abu Hurairah radhiyallahu anhu, dia berkata: Rasulullah shallallahu alaihi wa sallam bersabda: Sesungguhnya Allah Ta'ala berfirman: \"Barangsiapa memusuhi wali-Ku, maka sesungguhnya Aku mengumumkan perang kepadanya. Tidaklah seorang hamba-Ku mendekatkan diri kepada-Ku dengan sesuatu yang lebih Aku cintai daripada apa yang telah Aku wajibkan kepadanya. Dan seorang hamba-Ku senantiasa mendekatkan diri kepada-Ku dengan amalan-amalan sunnah hingga Aku mencintainya. Apabila Aku mencintainya, maka Aku adalah pendengarannya yang dia mendengar dengannya, pandangannya yang dia melihat dengannya, tangannya yang dia memegang dengannya, dan kakinya yang dia berjalan dengannya. Dan sungguh, jika dia meminta kepada-Ku, niscaya Aku akan memberinya, dan jika dia memohon perlindungan kepada-Ku, niscaya Aku akan melindunginya.\" [Diriwayatkan oleh Bukhari]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 38
      },
      "narration": null
    },
    {
      "hadithnumber": 39,
      "arabicnumber": 39,
      "text": "Dari Ibnu Abbas radhiyallahu anhuma, bahwa Rasulullah shallallahu alaihi wa sallam bersabda: \"Sesungguhnya Allah mengampuni dari umatku kesalahan, kelupaan, dan apa yang dipaksakan atas mereka\". Hadits hasan, diriwayatkan oleh Ibnu Majah [no: 2045], dan Al-Baihaqi [\"As-Sunan\" 7]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 39
      },
      "narration": null
    },
    {
      "hadithnumber": 40,
      "arabicnumber": 40,
      "text": "Dari Ibnu Umar radhiyallahu 'anhuma, beliau berkata: Rasulullah shallallahu 'alaihi wa sallam memegang pundakku, lalu bersabda: \"Jadilah di dunia seolah-olah engkau adalah orang asing atau musafir.\" Ibnu Umar radhiyallahu 'anhuma berkata: \"Jika engkau berada di sore hari, janganlah menunggu pagi, dan jika engkau berada di pagi hari, janganlah menunggu sore. Manfaatkanlah masa sehatmu untuk menghadapi masa sakitmu, dan manfaatkanlah masa hidupmu untuk menghadapi kematianmu.\" [Diriwayatkan oleh Bukhari]. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 40
      },
      "narration": null
    },
    {
      "hadithnumber": 41,
      "arabicnumber": 41,
      "text": "Dari Abu Muhammad Abdullah bin Amr bin Al-Ash radhiyallahu anhuma, ia berkata, Rasulullah shallallahu 'alaihi wa sallam bersabda, \"Tidak beriman salah seorang dari kalian hingga keinginannya mengikuti apa yang aku bawa.\"\nHadis hasan shahih, kami riwayatkan dalam kitab \"Al-Hujjah\" dengan sanad yang shahih. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 41
      },
      "narration": null
    },
    {
      "hadithnumber": 42,
      "arabicnumber": 42,
      "text": "Dari Anas bin Malik radhiyallahu anhu, ia berkata: Aku mendengar Rasulullah shallallahu alaihi wa sallam bersabda: Allah Ta'ala berfirman: \"Wahai anak Adam! Sesungguhnya selama engkau memohon kepada-Ku dan berharap kepada-Ku, Aku akan mengampunimu atas apa yang telah engkau lakukan, dan Aku tidak peduli. Wahai anak Adam! Sekiranya dosamu mencapai langit, kemudian engkau memohon ampun kepada-Ku, niscaya Aku akan mengampunimu. Wahai anak Adam! Sesungguhnya jika engkau datang kepada-Ku dengan kesalahan sepenuh bumi, kemudian engkau menemui-Ku dalam keadaan tidak menyekutukan-Ku dengan sesuatu pun, niscaya Aku akan datang kepadamu dengan ampunan sepenuh bumi.\"\nDiriwayatkan oleh Tirmidzi [nomor: 3540], ia berkata: Hadits hasan shahih. [Translated by Gemini 2.5 Flash]",
      "grades": [],
      "reference": {
        "book": 1,
        "hadith": 42
      },
      "narration": null
    }
  ],
  "metadata": {
    "sections": {},
    "section_details": {}
  }
}